{
    "articles": [
        {
            "id": 0,
            "titre": "Article 1",
            "date": "01/01/2018",
            "auteur": "Auteur 1",
            "tumbnail": "nom.png",
            "illustration": "nom.png/nom.png",
            "tags": [
                "tag1",
                "tag2"
            ],
            "contenu": "Contenu de l'article 1",
            "source": [
                {
                    "nom": "Source 1",
                    "lien": "lien1"
                },
                {
                    "nom": "Source 2",
                    "lien": "lien2"
                }
            ]
        },
        {
            "id": 1,
            "titre": "Ingénierie neuromorphique : L'avenir des interfaces cerveau-machine",
            "date": "02/12/2023",
            "auteur": "Arthur",
            "tumbnail": "nom.png",
            "illustration": "nom.png/nom.png",
            "tags": [
              "Bio",
              "Cyborg"
            ],
            "contenu": "Une Interface cerveau-machine ou ICM est un système permettant une liaison directe entre le cerveau et l’ordinateur, c'est-à-dire sans passer par les nerfs périphériques (reliant cerveau et moelle épinière aux muscles et aux organes du corps). Ces dispositifs ouvrent la porte à énormément d’applications, que ce soit médicale, militaire ou même pour un usage pratique.\n\nCe principe se place en opposition des systèmes qu’on pourrait vulgariser de “indirectes” comme le clavier ou une interaction tactiles. La recherche sur les ICM a commencé dans les années 1970 à l'université de Californie à Los Angeles, et c’est dans les années 1990 qu’elles seront pour la première fois appliquées sur l’Homme.\n\nLe principe de fonctionnement des ICM se base le plus souvent sur un système en boucle fermée comportant six étapes. La collecte et mesure de l’activité cérébrale, le prétraitement servant à éliminer les activités parasites, l’extraction de caractéristiques ou motifs, la classification qui va venir trier les caractéristiques, la traduction en commande de ses caractéristiques et enfin le retour perceptif qui agit comme feedback.\n\nAfin d’enregistrer l’activité cérébrale, il existe différentes méthodes, l’invasif, le semi-invasif et le non-invasif. L’invasif consiste à appliquer les capteurs directement dans le cortex, permettant une grande précision au prix d’un risque de complications élevées. Le semi-invasif consiste à appliquer les capteurs sur la membrane entourant le cerveau, juste sous la boîte crânienne, ce qui génère moins de risques mais fait perdre en précision. Le non-invasif pouvant se représenter comme un casque que l’on pose sur le crâne, offrant une solution certes bien moins précise que les deux précédentes mais aussi bien moins risqué et bien moins cher.\n\nLes applications aujourd’hui des ICM sont limitées et se focalisent sur le domaine médical afin d’aider des personnes paralyser ou ayant perdu un membre ou une fonction cognitive. Ce qui n’empêche pas non plus d’avoir des applications pratiques pour piloter des systèmes automatisés comme les ordinateurs. C’est ici qu’entre en jeu l’Ingénierie Neuromorphique.\n\nL’Ingénierie Neuromorphique est une approche de l’informatique qui s’inspire de la structure ainsi que du fonctionnement du cerveau humain en utilisant des neurones artificiels physiques pour effectuer des calculs. Elle est basée sur l'hypothèse que le cerveau humain, que l’on peut représenter comme un système informatique très puissant, est capable de traiter très efficacements les informations.\n\nLe principal avantage de l’Ingénierie Neuromorphique est la manière de traiter l’information très similaire au cerveau, ce qui permettrait une compatibilité accrue ainsi qu’un éventail de possibilités bien plus grand. Comme dit précédemment cela pourrait être une clé dans l’élaboration de solutions complexes afin d’aider les personnes souffrants de handicaps.\n\nMais allons plus loin et imaginons, de manière complètement hypothétique, ce que pourrait être le futur avec cette technologie, des ordinateurs avec lesquels on n’intéragit plus avec des claviers et des souris, des voitures qu’on ne conduirait plus avec un volant, des mails qu’on ne recevrait plus dans une boîte electronique, des commandes qu’on n’effectuerai plus sur des sites marchands, des contrôles d’identité où on ne présenterait plus une carte physique, des paiments entièrements dématérialisé, une vie que l’on contrôlerait par le pouvoir de notre cerveau.\n\nBien que l’on puisse imaginer les immenses et bénéfiques avancées technologiques permettant de propulser l’idée d’un monde connecté, pratique et avancé hors de la simple science fiction, il nous faut aussi nous poser des questions. Nous dirigerons-nous vers cette idée d’un monde utopiste ou verrons-nous une société nébulaire ou chacun est dépendant et contrôlé par la technologie.\n\nNous retrouverons-nous dans une situation similaire à celle des épisodes “The Entire History of You” (s1e3) et “Arkangel” (s4e2) de la série Black Mirror où respectivement chaque personne est équipée d’une puce permettant de retracer ses souvenirs et l’autre un implant permettant de voir et d’entendre au travers des yeux de quelqu’un.\n\nCela soulève également des questions sur la conscience et le principe même de réalité, est-ce que la certitude pourrait exister dans un monde tel que celui-ci. C’est la peur qui nous pousse à adopter le péssimisme face à de telles avancées, ce qui freine le progrès technologique mais, dans certains cas, ne vaut-il pas mieux être patient que de se retrouver trop vite débordé ou même emprisonné dans une situation qui a échappé à notre contrôle.\n\nFaisons l’effort de voir les choses avec pragmatisme, posons-nous les bonnes questions et souvenons-nous que peu importe la situation, peu importe les chances, il y a toujours de l’espoir.",
            "source": [
              {
                "nom": "Source 1",
                "lien": "https://sebastianvoelkl.com/2023/01/16/the-future-of-brain-computer-interfaces-how-neuromorphic-computing-is-changing-the-game/"
              },
              {
                "nom": "Source 2",
                "lien": "https://www.inserm.fr/dossier/interface-cerveau-machine-icm/"
              },
              {
                "nom": "Source 3",
                "lien": "https://www.academie-medecine.fr/wp-content/uploads/2021/02/Rapport-20-06-Interfaces-cerveau-machine-essais_2021_Bulletin-de-l-Acad-.pdf"
              },
              {
                "nom": "Source 4",
                "lien": "https://ccn.unistra.fr/websites/ccn/documentation/Sante-Ethique-Handicap/ICM_final_20201016.pdf"
              }
            ]
          },
          {
            "id": 2,
            "titre": "Informatique Quantique : Chiffrement post-quantique, l'avenir de la cybersécurité",
            "date": "02/12/2023",
            "auteur": "Pierre-Louis",
            "tumbnail": "nom.png",
            "illustration": "nom.png/nom.png",
            "tags": [
                "Quantique"
            ],
            "contenu": "Chaque année, les progrès technologiques marquent une évolution constante dans la fabrication d'ordinateurs toujours plus puissants. Dans cette recherche incessante de puissance, le domaine scientifique se tourne résolument vers la physique quantique pour concevoir des ordinateurs exploitant ces principes novateurs.\n\nPour appréhender la différence entre les ordinateurs traditionnels et ceux intégrant des éléments quantiques, il convient de se pencher sur leur fonctionnement respectif. Les ordinateurs classiques reposent sur un système binaire où chaque bit peut être soit 0, soit 1. En revanche, les ordinateurs quantiques s'appuient sur des principes de la physique quantique, tels que la superposition quantique, permettant la manipulation de qubits. À la différence des bits, les qubits peuvent simultanément représenter les valeurs 0 et 1, conférant aux ordinateurs quantiques une puissance de calcul considérablement supérieure.\n\nCette avancée technologique soulève des interrogations quant à son impact sur la cybersécurité. Actuellement, deux méthodes classiques d'encodage des données prédominent : la méthode symétrique et la méthode asymétrique. La méthode symétrique implique l'utilisation d'une clé identique pour le chiffrement et le déchiffrement, la sécurité reposant sur la complexité des combinaisons possibles de bits. Toutefois, l'ordinateur quantique, doté d'une puissance de calcul accrue, met en péril la sécurité des clés symétriques actuelles, y compris celles de 128 bits, habituellement considérées comme sécurisées.\n\nQuant à la méthode asymétrique, elle repose sur l'utilisation de clés distinctes pour le chiffrement et le déchiffrement, impliquant des algorithmes mathématiques complexes comme la factorisation de grands nombres ou la recherche de logarithmes discrets. Bien que ces problèmes soient actuellement insolubles pour les ordinateurs classiques, les ordinateurs quantiques pourraient les résoudre rapidement, exposant ainsi la vulnérabilité des données actuelles.\n\nCette situation concrète démontre que les dispositifs de sécurité actuels sont susceptibles d'être compromis par les capacités des ordinateurs quantiques. Cependant, cela n'implique pas nécessairement une insécurité totale. Actuellement en cours de développement, les ordinateurs quantiques devraient atteindre un niveau de sophistication permettant de compromettre les algorithmes d'encodage dans les 5 à 15 prochaines années, période souvent qualifiée de 'Q-day'. Cette estimation dépend néanmoins des progrès réalisés dans la recherche et la conception des ordinateurs quantiques.\n\nMalgré cette évolution imminente, le danger est déjà présent. On observe une tendance au Stock Now Decrypte Later (SNDL) de la part de divers acteurs tels que les gouvernements, les hackers et les entreprises. Ces acteurs stockent des données actuellement cryptées dans l'espoir de les décrypter ultérieurement à l'aide d'ordinateurs quantiques, dans le but d'en tirer profit. Cette pratique souligne l'urgence de ne pas attendre que les ordinateurs quantiques soient pleinement opérationnels pour mettre en place des mesures de protection.\n\nFace à ces ordinateurs dotés d'une puissance de calcul considérable, de nombreux gouvernements et entreprises renforcent déjà leurs normes de cybersécurité et recherchent des solutions pour sécuriser leurs données. Deux notions émergent comme des approches cruciales : la Post-Quantum Cryptography (PQC) et la crypto-agilité.\n\nLa PQC consiste simplement à renforcer les niveaux de sécurité sur les ordinateurs classiques. Par exemple, pour maintenir un niveau de sécurité équivalent face à un ordinateur quantique, il serait nécessaire de passer de clés symétriques de 128 bits à 256 bits. Pour les clés asymétriques, il faudrait baser les algorithmes sur des problèmes complexes, difficiles à résoudre tant pour les ordinateurs classiques que pour les ordinateurs quantiques.\n\nLa crypto-agilité, quant à elle, permet aux organisations de modifier rapidement leurs protocoles de cryptographie en réponse à de nouvelles menaces, assurant ainsi une posture de défense proactive.\n\nCes deux notions représentent les clés essentielles pour se protéger à la fois aujourd'hui et demain contre les défis posés par l'émergence des ordinateurs quantiques.\n\nMais allons plus loin et imaginons, de manière complètement hypothétique, ce que pourrait être le futur avec cette technologie, dans ce futur où la technologie quantique est omniprésente, le Quantum Directorate a émergé en tant qu'entité centralisée, gouvernant la société à travers un réseau puissant d'intelligence artificielle quantique. Inspiré par des références à 'Matrix' et 'Person of Interest', le Quantum Directorate exerce un contrôle absolu en surveillant tous les aspects de la vie quotidienne. Les citoyens vivent dans un monde où la réalité est filtrée à travers le prisme de la surveillance totale, évoquant un sentiment d'omniprésence et de perte de vie privée.\n\nCette domination s'étend jusqu'à l'économie, où une monnaie numérique quantique est introduite, reposant entièrement sur la cryptographie quantique. La maîtrise de cette économie devient le moyen ultime de pouvoir, créant une division profonde entre une élite technologique opulente et une majorité luttant pour survivre. Cette réalité économique polarisée rappelle les inégalités visuelles dans le film Elysium, et les divisions de classe dans la série Snowpiercer.\n\nLes lunettes quantiques, devenues omniprésentes, permettent aux individus de filtrer la réalité selon leurs préférences personnelles. Cette personnalisation extrême crée des bulles de réalité, semblables à celles explorées dans la série Black Mirror, où chacun vit dans sa propre version altérée du monde. Les réalités collectives et universelles s'effacent, laissant place à une fragmentation sociale et culturelle.\n\nPour atténuer les dérives dystopiques, la société a développé des intelligences artificielles éthiques quantiques, chargées de prendre des décisions morales. Cependant, ces entités ne sont pas à l'abri de la manipulation, menant à des scénarios éthiques complexes rappelant le film I, Robot et la série Westworld, où les IA peuvent se rebeller contre leurs créateurs, mettant en danger l'équilibre fragile de la société.\n\nParallèlement, des entités numériques indépendantes, les 'Ombres Quantiques', émergent à partir de fragments de données quantiques. Ces entités acquièrent la capacité d'influencer les pensées et les décisions humaines en manipulant l’information ainsi que les mondes virtuels, introduisant une dimension psychologique troublante dans la société. Inspirées par des éléments de l’univers de Ghost in the Shell et Altered Carbon, ces Ombres Quantiques défient la frontière entre la réalité et la virtualité, exacerbant les inquiétudes quant à la manipulation et au contrôle.",
            "source": [
                {
                    "nom": "Source 1",
                    "lien": "https://cosmian.com/post-quantum-encryption-the-future-of-cybersecurity/"
                },
                {
                    "nom": "Source 2",
                    "lien": "https://cosmian.com/quantum-ready-encryption-for-finance-the-future-is-now/"
                },
                {
                    "nom": "Source 3",
                    "lien": "https://www.youtube.com/watch?v=W13KR1iDfpE"
                },
                {
                    "nom": "Source 4",
                    "lien": "https://www.youtube.com/watch?v=-UrdExQW0cs"
                },
                {
                  "nom": "Source 5",
                  "lien": "https://www.cryptomathic.com/news-events/blog/how-to-protect-yourself-against-steal-now-decrypt-later#:~:text=Post%2Dquantum%20cryptography%20(PQC),to%20break%20traditional%20encryption%20algorithms."
                },
                {
                  "nom": "Source 6",
                  "lien": "https://www.linkedin.com/advice/1/what-potential-threats-vulnerabilities-quantum#:~:text=To%20counter%20this%20threat%2C%20researchers,both%20classical%20and%20quantum%20computers."
                }
            ]
        },
        {
          "id": 3,
          "titre": "Bio informatique:Les futurs Ordinateurs pourraient-ils fonctionner avec des cellules du cerveau humain",
          "date": "02/12/2023",
          "auteur": "Ethan",
          "tumbnail": "nom.png",
          "illustration": "nom.png/nom.png",
          "tags": [
              "Bio",
              "IA"
          ],
          "contenu": "Bio informatique:Les futurs Ordinateurs pourraient-ils fonctionner avec des cellules du cerveau humain\n\nL'Université Johns Hopkins à fait des recherches sur la possibilité d'utiliser des cellules de cerveaux humain dans les futurs ordinateurs pour élargir les capacités de l’informatique.\n\nIl existe déjà des système informatique utilisant des fonctions artificiels de cellule humaine dans notre vie actuelle qu’on appelle IA/AI (Intelligence artificiel/ Artificial intelligence) qui utilise la reproduction de neurones humaine afin de créer un système de neurones capable de communiquer avec des humains comme le fait actuellement les IA qu’on utilise (ex : ChatGPT).\n\nL’idée de l’ordinateur composé de cellules humaines est le fait de récupérer des cellules d’un être vivant ou qui était vivant afin de les intégrer à une machine tout en conservant leur vitalité pour permettre l’utilisation des données qui les composent et les utiliser à des fins scientifiques.\n\nComment pourrait fonctionner un bio ordinateur:\n\nLes bio ordinateur pourrait fonctionner en utilisant les organoids comme un moyen de stockage bien qu’aujourd’hui qu’un organoid mesure environ 3 millionième de la taille d’un cerveau humain et  peut donc stocker environ 800 Megaoctet de données, il serait donc possible d’utiliser les organoid comme grande base de donné capable de stocker énormément de donné si on augmente la taille de ces derniers afin d’atteindre une taille capable d’avoir une capacité de stockage d’environ 100 téraoctet ou plus, ce qui permettra une grande communication de données ce qui présentera un problème, comment pouvons nous gérer les données stockées dans les organoid et comment pouvons nous les manipuler afin de restreindre leur fonction et éviter de laisser une trop grande liberté aux organoid qui pourrait un jour développer une conscience suite au stockage d’un grand nombre de donné sachant qu’avec des organoids il sera possible de les utiliser comme outils d'apprentissage automatique d’information donc des intelligences artificiels.\n\nGestion éthique des organoids cérébraux:\n\nLes organoids cérébraux présente beaucoup de question d’éthique surtout avec son utilisation qui pourrait varier selon les nécessités des structures qui les utilisent, il serait possible de créer des bioordinateurs public qui sont régit par des loi éthique pour éviter tout égard avec et d’autre plus privé destiné à un but précis afin d’avoir une gestion précise et simple de leur manipulation afin de contrôler les information qu’ils récupère et les filtrer pour bloquer toute information à but malveillant.\n\nL’idée d'implanter des cellules de cerveaux humain est un sujet qui porte aujourd’hui à réflexion car c’est un sujet qui présente des questionnements comme des avantages qui sont tous à ne pas négliger.\n\nBénéfice :\n\nUne réactivité et compréhension accru de l’information avec la création d’un système complexe  et aussi de permettre de réduire le coût en énergie des supers calculateurs actuels\n\nLe sujet de la bio informatique organoid est très intéressant et apporter des amélioration dans le monde de la recherche mais on pourrait se poser les questions suivantes:\n\nComment peut-on conserver les cellules humaines utilisées dans la bio informatique sur le long terme ?\n\nComment pourra-t’on canaliser et manipuler les informations que traiteront ces ordinateurs organoïd ?\n\nDans quel domaine la bio informatique organoid pourrait être utilisée autre que pour des supers calculs ?",
          "source": [
              {
                  "nom": "Source 1",
                  "lien": "https://hub.jhu.edu/2023/02/28/organoid-intelligence-biocomputers/"
              },
              {
                  "nom": "Source 2",
                  "lien": "https://edition.cnn.com/2023/03/02/world/brain-computer-organoids-scn/index.html"
              }
          ]
      }
          
    ]
}